grevaillot/svd_tools/headers/ATSAMV71Q19B/pmc.h
#pragma once 

/* --- PMC: Power Management Controller ----------------------------- */

/** @defgroup pmc_registers Power Management Controller Register
@{*/

/** PMC_PMC_SCER System Clock Enable Register **/
#define PMC_PMC_SCER			MMIO32(PMC_BASE + 0x00)
/** PMC_PMC_SCDR System Clock Disable Register **/
#define PMC_PMC_SCDR			MMIO32(PMC_BASE + 0x04)
/** PMC_PMC_SCSR System Clock Status Register **/
#define PMC_PMC_SCSR			MMIO32(PMC_BASE + 0x08)
/** PMC_PMC_PCER0 Peripheral Clock Enable Register 0 **/
#define PMC_PMC_PCER0			MMIO32(PMC_BASE + 0x10)
/** PMC_PMC_PCDR0 Peripheral Clock Disable Register 0 **/
#define PMC_PMC_PCDR0			MMIO32(PMC_BASE + 0x14)
/** PMC_PMC_PCSR0 Peripheral Clock Status Register 0 **/
#define PMC_PMC_PCSR0			MMIO32(PMC_BASE + 0x18)
/** PMC_CKGR_UCKR UTMI Clock Register **/
#define PMC_CKGR_UCKR			MMIO32(PMC_BASE + 0x1c)
/** PMC_CKGR_MOR Main Oscillator Register **/
#define PMC_CKGR_MOR			MMIO32(PMC_BASE + 0x20)
/** PMC_CKGR_MCFR Main Clock Frequency Register **/
#define PMC_CKGR_MCFR			MMIO32(PMC_BASE + 0x24)
/** PMC_CKGR_PLLAR PLLA Register **/
#define PMC_CKGR_PLLAR			MMIO32(PMC_BASE + 0x28)
/** PMC_PMC_MCKR Master Clock Register **/
#define PMC_PMC_MCKR			MMIO32(PMC_BASE + 0x30)
/** PMC_PMC_USB USB Clock Register **/
#define PMC_PMC_USB			MMIO32(PMC_BASE + 0x38)
/** PMC_PMC_PCK[0] Programmable Clock Register **/
#define PMC_PMC_PCK[0]			MMIO32(PMC_BASE + 0x40)
/** PMC_PMC_PCK[1] Programmable Clock Register **/
#define PMC_PMC_PCK[1]			MMIO32(PMC_BASE + 0x44)
/** PMC_PMC_PCK[2] Programmable Clock Register **/
#define PMC_PMC_PCK[2]			MMIO32(PMC_BASE + 0x48)
/** PMC_PMC_PCK[3] Programmable Clock Register **/
#define PMC_PMC_PCK[3]			MMIO32(PMC_BASE + 0x4c)
/** PMC_PMC_PCK[4] Programmable Clock Register **/
#define PMC_PMC_PCK[4]			MMIO32(PMC_BASE + 0x50)
/** PMC_PMC_PCK[5] Programmable Clock Register **/
#define PMC_PMC_PCK[5]			MMIO32(PMC_BASE + 0x54)
/** PMC_PMC_PCK[6] Programmable Clock Register **/
#define PMC_PMC_PCK[6]			MMIO32(PMC_BASE + 0x58)
/** PMC_PMC_PCK[7] Programmable Clock Register **/
#define PMC_PMC_PCK[7]			MMIO32(PMC_BASE + 0x5c)
/** PMC_PMC_IER Interrupt Enable Register **/
#define PMC_PMC_IER			MMIO32(PMC_BASE + 0x60)
/** PMC_PMC_IDR Interrupt Disable Register **/
#define PMC_PMC_IDR			MMIO32(PMC_BASE + 0x64)
/** PMC_PMC_SR Status Register **/
#define PMC_PMC_SR			MMIO32(PMC_BASE + 0x68)
/** PMC_PMC_IMR Interrupt Mask Register **/
#define PMC_PMC_IMR			MMIO32(PMC_BASE + 0x6c)
/** PMC_PMC_FSMR Fast Startup Mode Register **/
#define PMC_PMC_FSMR			MMIO32(PMC_BASE + 0x70)
/** PMC_PMC_FSPR Fast Startup Polarity Register **/
#define PMC_PMC_FSPR			MMIO32(PMC_BASE + 0x74)
/** PMC_PMC_FOCR Fault Output Clear Register **/
#define PMC_PMC_FOCR			MMIO32(PMC_BASE + 0x78)
/** PMC_PMC_WPMR Write Protection Mode Register **/
#define PMC_PMC_WPMR			MMIO32(PMC_BASE + 0xe4)
/** PMC_PMC_WPSR Write Protection Status Register **/
#define PMC_PMC_WPSR			MMIO32(PMC_BASE + 0xe8)
/** PMC_PMC_PCER1 Peripheral Clock Enable Register 1 **/
#define PMC_PMC_PCER1			MMIO32(PMC_BASE + 0x100)
/** PMC_PMC_PCDR1 Peripheral Clock Disable Register 1 **/
#define PMC_PMC_PCDR1			MMIO32(PMC_BASE + 0x104)
/** PMC_PMC_PCSR1 Peripheral Clock Status Register 1 **/
#define PMC_PMC_PCSR1			MMIO32(PMC_BASE + 0x108)
/** PMC_PMC_PCR Peripheral Control Register **/
#define PMC_PMC_PCR			MMIO32(PMC_BASE + 0x10c)
/** PMC_PMC_OCR Oscillator Calibration Register **/
#define PMC_PMC_OCR			MMIO32(PMC_BASE + 0x110)
/** PMC_PMC_SLPWK_ER0 SleepWalking Enable Register 0 **/
#define PMC_PMC_SLPWK_ER0			MMIO32(PMC_BASE + 0x114)
/** PMC_PMC_SLPWK_DR0 SleepWalking Disable Register 0 **/
#define PMC_PMC_SLPWK_DR0			MMIO32(PMC_BASE + 0x118)
/** PMC_PMC_SLPWK_SR0 SleepWalking Status Register 0 **/
#define PMC_PMC_SLPWK_SR0			MMIO32(PMC_BASE + 0x11c)
/** PMC_PMC_SLPWK_ASR0 SleepWalking Activity Status Register 0 **/
#define PMC_PMC_SLPWK_ASR0			MMIO32(PMC_BASE + 0x120)
/** PMC_PMC_PMMR PLL Maximum Multiplier Value Register **/
#define PMC_PMC_PMMR			MMIO32(PMC_BASE + 0x130)
/** PMC_PMC_SLPWK_ER1 SleepWalking Enable Register 1 **/
#define PMC_PMC_SLPWK_ER1			MMIO32(PMC_BASE + 0x134)
/** PMC_PMC_SLPWK_DR1 SleepWalking Disable Register 1 **/
#define PMC_PMC_SLPWK_DR1			MMIO32(PMC_BASE + 0x138)
/** PMC_PMC_SLPWK_SR1 SleepWalking Status Register 1 **/
#define PMC_PMC_SLPWK_SR1			MMIO32(PMC_BASE + 0x13c)
/** PMC_PMC_SLPWK_ASR1 SleepWalking Activity Status Register 1 **/
#define PMC_PMC_SLPWK_ASR1			MMIO32(PMC_BASE + 0x140)
/** PMC_PMC_SLPWK_AIPR SleepWalking Activity In Progress Register **/
#define PMC_PMC_SLPWK_AIPR			MMIO32(PMC_BASE + 0x144)

/**@}*/


/** @defgroup pmc_pmc_scer PMCSCER System Clock Enable Register
@{*/

/** PMC_PMC_SCER_PCK7 Programmable Clock 7 Output Enable **/
#define PMC_PMC_SCER_PCK7		(1 << 15)
/** PMC_PMC_SCER_PCK6 Programmable Clock 6 Output Enable **/
#define PMC_PMC_SCER_PCK6		(1 << 14)
/** PMC_PMC_SCER_PCK5 Programmable Clock 5 Output Enable **/
#define PMC_PMC_SCER_PCK5		(1 << 13)
/** PMC_PMC_SCER_PCK4 Programmable Clock 4 Output Enable **/
#define PMC_PMC_SCER_PCK4		(1 << 12)
/** PMC_PMC_SCER_PCK3 Programmable Clock 3 Output Enable **/
#define PMC_PMC_SCER_PCK3		(1 << 11)
/** PMC_PMC_SCER_PCK2 Programmable Clock 2 Output Enable **/
#define PMC_PMC_SCER_PCK2		(1 << 10)
/** PMC_PMC_SCER_PCK1 Programmable Clock 1 Output Enable **/
#define PMC_PMC_SCER_PCK1		(1 << 9)
/** PMC_PMC_SCER_PCK0 Programmable Clock 0 Output Enable **/
#define PMC_PMC_SCER_PCK0		(1 << 8)
/** PMC_PMC_SCER_USBCLK Enable USB FS Clock **/
#define PMC_PMC_SCER_USBCLK		(1 << 5)

/**@}*/

/** @defgroup pmc_pmc_scdr PMCSCDR System Clock Disable Register
@{*/

/** PMC_PMC_SCDR_PCK7 Programmable Clock 7 Output Disable **/
#define PMC_PMC_SCDR_PCK7		(1 << 15)
/** PMC_PMC_SCDR_PCK6 Programmable Clock 6 Output Disable **/
#define PMC_PMC_SCDR_PCK6		(1 << 14)
/** PMC_PMC_SCDR_PCK5 Programmable Clock 5 Output Disable **/
#define PMC_PMC_SCDR_PCK5		(1 << 13)
/** PMC_PMC_SCDR_PCK4 Programmable Clock 4 Output Disable **/
#define PMC_PMC_SCDR_PCK4		(1 << 12)
/** PMC_PMC_SCDR_PCK3 Programmable Clock 3 Output Disable **/
#define PMC_PMC_SCDR_PCK3		(1 << 11)
/** PMC_PMC_SCDR_PCK2 Programmable Clock 2 Output Disable **/
#define PMC_PMC_SCDR_PCK2		(1 << 10)
/** PMC_PMC_SCDR_PCK1 Programmable Clock 1 Output Disable **/
#define PMC_PMC_SCDR_PCK1		(1 << 9)
/** PMC_PMC_SCDR_PCK0 Programmable Clock 0 Output Disable **/
#define PMC_PMC_SCDR_PCK0		(1 << 8)
/** PMC_PMC_SCDR_USBCLK Disable USB FS Clock **/
#define PMC_PMC_SCDR_USBCLK		(1 << 5)

/**@}*/

/** @defgroup pmc_pmc_scsr PMCSCSR System Clock Status Register
@{*/

/** PMC_PMC_SCSR_PCK7 Programmable Clock 7 Output Status **/
#define PMC_PMC_SCSR_PCK7		(1 << 15)
/** PMC_PMC_SCSR_PCK6 Programmable Clock 6 Output Status **/
#define PMC_PMC_SCSR_PCK6		(1 << 14)
/** PMC_PMC_SCSR_PCK5 Programmable Clock 5 Output Status **/
#define PMC_PMC_SCSR_PCK5		(1 << 13)
/** PMC_PMC_SCSR_PCK4 Programmable Clock 4 Output Status **/
#define PMC_PMC_SCSR_PCK4		(1 << 12)
/** PMC_PMC_SCSR_PCK3 Programmable Clock 3 Output Status **/
#define PMC_PMC_SCSR_PCK3		(1 << 11)
/** PMC_PMC_SCSR_PCK2 Programmable Clock 2 Output Status **/
#define PMC_PMC_SCSR_PCK2		(1 << 10)
/** PMC_PMC_SCSR_PCK1 Programmable Clock 1 Output Status **/
#define PMC_PMC_SCSR_PCK1		(1 << 9)
/** PMC_PMC_SCSR_PCK0 Programmable Clock 0 Output Status **/
#define PMC_PMC_SCSR_PCK0		(1 << 8)
/** PMC_PMC_SCSR_USBCLK USB FS Clock Status **/
#define PMC_PMC_SCSR_USBCLK		(1 << 5)
/** PMC_PMC_SCSR_HCLKS HCLK Status **/
#define PMC_PMC_SCSR_HCLKS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcer0 PMCPCER0 Peripheral Clock Enable Register 0
@{*/

/** PMC_PMC_PCER0_PID31 Peripheral Clock 31 Enable **/
#define PMC_PMC_PCER0_PID31		(1 << 31)
/** PMC_PMC_PCER0_PID30 Peripheral Clock 30 Enable **/
#define PMC_PMC_PCER0_PID30		(1 << 30)
/** PMC_PMC_PCER0_PID29 Peripheral Clock 29 Enable **/
#define PMC_PMC_PCER0_PID29		(1 << 29)
/** PMC_PMC_PCER0_PID28 Peripheral Clock 28 Enable **/
#define PMC_PMC_PCER0_PID28		(1 << 28)
/** PMC_PMC_PCER0_PID27 Peripheral Clock 27 Enable **/
#define PMC_PMC_PCER0_PID27		(1 << 27)
/** PMC_PMC_PCER0_PID26 Peripheral Clock 26 Enable **/
#define PMC_PMC_PCER0_PID26		(1 << 26)
/** PMC_PMC_PCER0_PID25 Peripheral Clock 25 Enable **/
#define PMC_PMC_PCER0_PID25		(1 << 25)
/** PMC_PMC_PCER0_PID24 Peripheral Clock 24 Enable **/
#define PMC_PMC_PCER0_PID24		(1 << 24)
/** PMC_PMC_PCER0_PID23 Peripheral Clock 23 Enable **/
#define PMC_PMC_PCER0_PID23		(1 << 23)
/** PMC_PMC_PCER0_PID22 Peripheral Clock 22 Enable **/
#define PMC_PMC_PCER0_PID22		(1 << 22)
/** PMC_PMC_PCER0_PID21 Peripheral Clock 21 Enable **/
#define PMC_PMC_PCER0_PID21		(1 << 21)
/** PMC_PMC_PCER0_PID20 Peripheral Clock 20 Enable **/
#define PMC_PMC_PCER0_PID20		(1 << 20)
/** PMC_PMC_PCER0_PID19 Peripheral Clock 19 Enable **/
#define PMC_PMC_PCER0_PID19		(1 << 19)
/** PMC_PMC_PCER0_PID18 Peripheral Clock 18 Enable **/
#define PMC_PMC_PCER0_PID18		(1 << 18)
/** PMC_PMC_PCER0_PID17 Peripheral Clock 17 Enable **/
#define PMC_PMC_PCER0_PID17		(1 << 17)
/** PMC_PMC_PCER0_PID16 Peripheral Clock 16 Enable **/
#define PMC_PMC_PCER0_PID16		(1 << 16)
/** PMC_PMC_PCER0_PID15 Peripheral Clock 15 Enable **/
#define PMC_PMC_PCER0_PID15		(1 << 15)
/** PMC_PMC_PCER0_PID14 Peripheral Clock 14 Enable **/
#define PMC_PMC_PCER0_PID14		(1 << 14)
/** PMC_PMC_PCER0_PID13 Peripheral Clock 13 Enable **/
#define PMC_PMC_PCER0_PID13		(1 << 13)
/** PMC_PMC_PCER0_PID12 Peripheral Clock 12 Enable **/
#define PMC_PMC_PCER0_PID12		(1 << 12)
/** PMC_PMC_PCER0_PID11 Peripheral Clock 11 Enable **/
#define PMC_PMC_PCER0_PID11		(1 << 11)
/** PMC_PMC_PCER0_PID10 Peripheral Clock 10 Enable **/
#define PMC_PMC_PCER0_PID10		(1 << 10)
/** PMC_PMC_PCER0_PID9 Peripheral Clock 9 Enable **/
#define PMC_PMC_PCER0_PID9		(1 << 9)
/** PMC_PMC_PCER0_PID8 Peripheral Clock 8 Enable **/
#define PMC_PMC_PCER0_PID8		(1 << 8)
/** PMC_PMC_PCER0_PID7 Peripheral Clock 7 Enable **/
#define PMC_PMC_PCER0_PID7		(1 << 7)

/**@}*/

